Revit 2026 API

# FabricationNetworkChangeServiceSetMapOfInLinePartTypes Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMapOfInLinePartTypes(
	IDictionary<ElementId, ElementId> fabricationPartTypes
)
```
```vb
Public Sub SetMapOfInLinePartTypes (
	fabricationPartTypes As IDictionary(Of ElementId, ElementId)
)
```
```cpp
public:
void SetMapOfInLinePartTypes(
	IDictionary<ElementId^, ElementId^>^ fabricationPartTypes
)
```
```fsharp
member SetMapOfInLinePartTypes :
        fabricationPartTypes : IDictionary<ElementId, ElementId> -> unit
```

#### Parameters

fabricationPartTypes IDictionaryElementId, ElementId

#### Reference

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace